# Список задач на неделю с добавлением статуса выполнения
weekly_tasks = {
    "понедельник": [
        {"task": "Чистка гриндера", "completed": False},
        {"task": "Чистка гейзеров", "completed": False},
        {"task": "Протереть стекло входной двери", "completed": False},
        {"task": "Замачивание форсунок и их чистка", "completed": False},
        {"task": "Протереть стекло входной двери", "completed": False}
    ],
    "вторник": [
        {"task": "Протереть лайт боксы и вывески", "completed": False},
        {"task": "Вымести листья и мусор под трибуны", "completed": False},
        {"task": "Натереть зеркала", "completed": False},
        {"task": "Замачивание форсунок и их чистка", "completed": False},
        {"task": "Протереть стекло входной двери", "completed": False}
    ],
    "среда": [
        {"task": "Чистка гриля и микроволновки", "completed": False},
        {"task": "Заточка ножей", "completed": False},
        {"task": "Протереть пыль (картины, батареи, полки)", "completed": False},
        {"task": "Замачивание форсунок и их чистка", "completed": False},
        {"task": "Протереть стекло входной двери", "completed": False}
    ],
    "четверг": [
        {"task": "Уборка на складе", "completed": False},
        {"task": "Чистка гриндера", "completed": False},
        {"task": "Зона витрины (убрать все подносы и замыть, натереть витрину внутри)", "completed": False},
        {"task": "Замачивание форсунок и их чистка", "completed": False},
        {"task": "Протереть стекло входной двери", "completed": False}
    ],
    "пятница": [
        {"task": "Протереть лайт боксы, гирлянду и вывеску", "completed": False},
        {"task": "Зона шкафов на баре (протереть полки, расставить продукцию, пополнить необходимое)", "completed": False},
        {"task": "Замачивание форсунок и их чистка", "completed": False},
        {"task": "Протереть стекло входной двери", "completed": False}
    ],
    "суббота": [
        {"task": "Чистка термопода кафизой", "completed": False},
        {"task": "Чистка блендера кафизой", "completed": False},
        {"task": "Протереть шкафы сверху", "completed": False},
        {"task": "Протереть духовку (стекло)", "completed": False},
        {"task": "Замачивание форсунок и их чистка", "completed": False},
        {"task": "Протереть стекло входной двери", "completed": False}
    ],
    "воскресенье": [
        {"task": "Почистить большой пылесос", "completed": False},
        {"task": "Протереть пыль (картины, батареи, полки)", "completed": False},
        {"task": "Протереть и помыть низ бара", "completed": False},
        {"task": "Замачивание форсунок и их чистка", "completed": False},
        {"task": "Протереть стекло входной двери", "completed": False}
    ]
}
