# Список задач на неделю
weekly_tasks = {
    "понедельник": ["Чистка гриндера", "Чистка гейзеров", "Замачивание форсунок и их чистка"],
    "вторник": ["Протереть лайт боксы и вывески", "Вымести листья и мусор под трибуны", "Натереть зеркала", "Замачивание форсунок и их чистка"],
    "среда": ["Чистка гриля и микроволновки", "Заточка ножей", "Протереть пыль (картины, батареи, полки)", "Замачивание форсунок и их чистка"],
    "четверг": ["Уборка на складе", "Чистка гриндера", "Зона витрины (убрать все подносы и замыть, натереть витрину внутри)", "Замачивание форсунок и их чистка"],
    "пятница": ["Протереть лайт боксы, гирлянду и вывеску", "Зона шкафов на баре (протереть полки, расставить продукцию, пополнить необходимое)", "Замачивание форсунок и их чистка"],
    "суббота": ["Чистка термопода кафизой", "Чистка блендера кафизой", "Протереть шкафы сверху", "Замачивание форсунок и их чистка"],
    "воскресенье": ["Почистить большой пылесос", "Протереть пыль (картины, батареи, полки)", "Протереть и помыть низ бара", "Замачивание форсунок и их чистка"]
}
